In [1]:
# the "#" in a code cell indicates a comment, test after the # will not be executed
import math

# Now that we have imported math we can access some of the elements identified in 
# the package.
# For example math contains a definition for pi, we can access that by executing 
# the pi method of the library math

math.pi

3.141592653589793

In [2]:
from math import pi,cos,sin

print(pi)
print(cos(3))

3.141592653589793
-0.9899924966004454

In [3]:
import math as m
print(m.pi)
print(m.cos(3))

3.141592653589793
-0.9899924966004454

In [4]:
import pandas as pd

In [5]:
values=[7,8,9,10,11]
weird=["Some text","Some more Text",2,3]

# Here the constructor is passed a numeric list
Simplest=pd.Series([2,3,4,5,6,7])
Simplest

0    2
1    3
2    4
3    5
4    6
5    7
dtype: int64

In [6]:
# In this case the constructor is passed a variable that contains a list
simple2=pd.Series(values)
simple2

0     7
1     8
2     9
3    10
4    11
dtype: int64

In [7]:
# Here the constructor is passed a variable containing a list that is a mix of 
# alphanumerics and numerical values
simple3=pd.Series(weird)
simple3

0         Some text
1    Some more Text
2                 2
3                 3
dtype: object

In [8]:
# In this example the constructor is given both the values 
# and specific values for the index
Simplest=pd.Series([2,3,4,5,6],index=[1966,1967,1996,1999,2000])
Simplest

1966    2
1967    3
1996    4
1999    5
2000    6
dtype: int64

In [9]:
simple2=pd.Series(values,index=[1966,1967,1996,1999,2000])
simple2

1966     7
1967     8
1996     9
1999    10
2000    11
dtype: int64

In [10]:
mydict2={1966:2,1967:3,1968:4,1969:5,2000:6}
simple2=pd.Series(mydict2)
simple2

1966    2
1967    3
1968    4
1969    5
2000    6
dtype: int64

In [11]:

df = pd.DataFrame({'B': [1,1,1,1],'C':[1,2,3,6],'E':[4,4,4,4]},index=[2018,2019,2020,2021])
df

      B  C  E
2018  1  1  4
2019  1  2  4
2020  1  3  4
2021  1  6  4

In [12]:
#define the number of years for which the data is to be created.
number_of_rows = 6 

# call the dataframe constructor
df = pd.DataFrame(100,
       index=[2020+v for v in range(number_of_rows)], # create row index
       # equivalent to index=[2020,2021,2022,2023,2024,2025] 
       columns=['A','B'])                                 # create column name 
df

        A    B
2020  100  100
2021  100  100
2022  100  100
2023  100  100
2024  100  100
2025  100  100

In [13]:


df1 = pd.DataFrame(200,
       index=[v for v in range(2020,2030)], # create row index
       # equivalent to index=[2020,2021,...,2030] 
       columns=['A1','B1'])                                 # create column name 
df1

       A1   B1
2020  200  200
2021  200  200
2022  200  200
2023  200  200
2024  200  200
2025  200  200
2026  200  200
2027  200  200
2028  200  200
2029  200  200

In [14]:
df["NEW"]=[10,12,10,13,14,15]  #df origiall has 6 rows so we must suup,y 6 data points for this command to run error free
df

        A    B  NEW
2020  100  100   10
2021  100  100   12
2022  100  100   10
2023  100  100   13
2024  100  100   14
2025  100  100   15

In [15]:
df["NEW"]=[11,12,10,14,2,1]

df

        A    B  NEW
2020  100  100   11
2021  100  100   12
2022  100  100   10
2023  100  100   14
2024  100  100    2
2025  100  100    1

In [16]:
# replace all of the rows of column B with the same value
df['B']=17
df

        A   B  NEW
2020  100  17   11
2021  100  17   12
2022  100  17   10
2023  100  17   14
2024  100  17    2
2025  100  17    1

In [17]:
df.columns

Index(['A', 'B', 'NEW'], dtype='object')

In [18]:
df.columns.size

3

In [19]:
df.eval('''X = B*NEW
           THE_ANSWER = 42''')

        A   B  NEW    X  THE_ANSWER
2020  100  17   11  187          42
2021  100  17   12  204          42
2022  100  17   10  170          42
2023  100  17   14  238          42
2024  100  17    2   34          42
2025  100  17    1   17          42

In [20]:
df

        A   B  NEW
2020  100  17   11
2021  100  17   12
2022  100  17   10
2023  100  17   14
2024  100  17    2
2025  100  17    1

In [21]:
df=df.eval('''X = B*NEW
           THE_ANSWER = 42''')
df

        A   B  NEW    X  THE_ANSWER
2020  100  17   11  187          42
2021  100  17   12  204          42
2022  100  17   10  170          42
2023  100  17   14  238          42
2024  100  17    2   34          42
2025  100  17    1   17          42

In [22]:
df.loc[2023,'NEW']

14

In [23]:
df.loc[:,'NEW']

2020    11
2021    12
2022    10
2023    14
2024     2
2025     1
Name: NEW, dtype: int64

In [24]:
df.loc[2023,:]

A             100
B              17
NEW            14
X             238
THE_ANSWER     42
Name: 2023, dtype: int64

In [25]:
df.loc[[2021,2024],['B','NEW']]

       B  NEW
2021  17   12
2024  17    2

In [26]:

df.loc[2021:2023,['B','NEW']]

       B  NEW
2021  17   12
2022  17   10
2023  17   14

In [27]:
df.loc[2022:2024,'NEW'] = 17
df

        A   B  NEW    X  THE_ANSWER
2020  100  17   11  187          42
2021  100  17   12  204          42
2022  100  17   17  170          42
2023  100  17   17  238          42
2024  100  17   17   34          42
2025  100  17    1   17          42